---
kind: property
id: P:Autodesk.Revit.DB.ThermalProperties.Roughness
source: html/c6f24d0d-9a50-5ddc-3e18-da5df3bf5f96.htm
---
# Autodesk.Revit.DB.ThermalProperties.Roughness Property

Value of roughness.

## Syntax (C#)
```csharp
public int Roughness { get; set; }
```